routes/web.php

select * from "posts"
---
use Illuminate\Support\Facades\Route;
use \Illuminate\Http\Request;

Route::get('/', function (Request $request) {
    $query = Post::with('author')->latest();

    if ($request->has('search')) {
      $search = $request->input('search');
      $query->where(function ($q) use ($search) {
          $q->where('title', 'like', '%' . $search . '%')
            ->orWhere('body', 'like', '%' . $search . '%');
      });
    }

    $posts = $query->paginate(8)->withQueryString();

    return view('home', [
        'posts' => $posts
    ]);
});